tap "alajmo/mani"
# General-purpose scripting language
brew "php"
# Terminal multiplexer
brew "tmux"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Check your $HOME for unwanted files and directories
brew "xdg-ninja"
# Tools for building Android applications
cask "android-studio"
# Application uninstaller
cask "appcleaner"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Xcode extension for GitHub Copilot
cask "github-copilot-for-xcode"
# Web browser
cask "google-chrome"
# GPU-based terminal emulator
cask "kitty"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mac-mouse-fix"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Music streaming service
cask "spotify"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Open-source code editor
cask "visual-studio-code@insiders"
# Native desktop client for WhatsApp
cask "whatsapp"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
go "cmd/go"
go "cmd/gofmt"
